# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?

s=int(input("Всего журавликов: "))
pc=s//6
k=pc*4
print("Петя сделал -",pc,"журавликов")
print("Катя сделала -",k,"журавликов")
print("Серёжа сделал -",pc,"журавликов")