#Задача 2: Найдите сумму цифр трехзначного числа.

s = input("Введите трехзначное число: ")
s = int(s)
a = s % 10
b = s % 100 // 10
c = s // 100
print("Сумма цифр числа: ", a + b + c)

