# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета.

sb = input('Введите шестизначное число: ')
a = int(sb[0])
b = int(sb[1])
c = int(sb[2])
d = int(sb[3])
e = int(sb[4])
f = int(sb[5])

if a + b + c == d + e + f:
    print('YES')

else:
    print('NO')    
